[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [8]:
import pandas as pd
import numpy as np

In [9]:
sevens = pd.Series(np.arange(7,51,7), index=list('abcdefghijklmnopqrstuvwxyz')[:7], name='sevens')
sevens

a     7
b    14
c    21
d    28
e    35
f    42
g    49
Name: sevens, dtype: int32

In [10]:
print(sevens.index, sevens.values, sevens.dtype, sevens.ndim, sevens.shape, sevens.size, sep='\n\n')

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

[ 7 14 21 28 35 42 49]

int32

1

(7,)

7

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력 
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [11]:
file ='../DATA/knu_data.csv'
knuDF = pd.read_csv(file)
knuDF.set_index('team', inplace=True)
# print(knuDF.index, knuDF.values, knuDF.ndim, knuDF.shape,knuDF.size, sep='\n\n')
knuDF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries,  경영지원팀 to  경영지원팀
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mem_id  5 non-null      object
 1   time    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [12]:
knuDF['time'] = pd.to_datetime(knuDF['time'])
print(knuDF.dtypes)

mem_id            object
time      datetime64[ns]
dtype: object

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역 
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역 
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [13]:
file2 = '../DATA/stats_100701.xlsx'
statsDF = pd.read_excel(file2)
statsDF.columns = statsDF.iloc[0]
statsDF = statsDF.drop(statsDF.index[0])
statsDF

0   NaN   2015   2016   2017   2018
1     계  51015  51218  51362  51607
2    서울   9941   9843   9766   9705
3    부산   3452   3447   3424   3400
4    대구   2469   2461   2458   2450
5    인천   2883   2907   2924   2939
6    광주   1506   1502   1495   1493
7    대전   1542   1536   1528   1518
8    울산   1164   1166   1159   1154
9    세종    187    234    266    304
10   경기  12423  12600  12786  13031
11   강원   1517   1521   1521   1521
12   충북   1589   1601   1609   1619
13   충남   2103   2126   2153   2180
14   전북   1835   1835   1829   1820
15   전남   1797   1798   1795   1790
16   경북   2678   2683   2675   2674
17   경남   3330   3338   3339   3356
18   제주    599    618    635    653
19  수도권  25247  25350  25476  25675

In [18]:
print(statsDF.sort_values(by=[2015], ascending=False).head(2))
print(statsDF.sort_values(by=[2015], ascending=False).tail(1))

0   NaN   2015   2016   2017   2018
1     계  51015  51218  51362  51607
19  수도권  25247  25350  25476  25675
0 NaN  2015  2016  2017  2018
9  세종   187   234   266   304

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [15]:
file3='../DATA/stock price.xlsx'
stockDF = pd.read_excel(file3)
stockDF

        id stock_name          value     price
0   128940       한미약품   59385.666667  421000.0
1   138040    메리츠금융지주     827.500000       NaN
2   130960     CJ E&M   58540.666667   98900.0
3   138250      엔에스쇼핑   14558.666667   13200.0
4   139480        이마트  239230.833333  254500.0
5   142280     녹십자엠에스     468.833333   10200.0
6   145990        삼양사   82750.000000   82000.0
7   181710  NHN엔터테인먼트            NaN       NaN
8   185750        종근당   40293.666667  100500.0
9   192400      쿠쿠홀딩스  179204.666667  177500.0
10  199800         툴젠   -2514.333333  115400.0
11  204210     모두투어리츠    3093.333333    3475.0
12  207940   삼성바이오로직스            NaN   91900.0

In [16]:
stockDF.set_index('stock_name', inplace=True)
stockDF

                id          value     price
stock_name
한미약품        128940   59385.666667  421000.0
메리츠금융지주     138040     827.500000       NaN
CJ E&M      130960   58540.666667   98900.0
엔에스쇼핑       138250   14558.666667   13200.0
이마트         139480  239230.833333  254500.0
녹십자엠에스      142280     468.833333   10200.0
삼양사         145990   82750.000000   82000.0
NHN엔터테인먼트   181710            NaN       NaN
종근당         185750   40293.666667  100500.0
쿠쿠홀딩스       192400  179204.666667  177500.0
툴젠          199800   -2514.333333  115400.0
모두투어리츠      204210    3093.333333    3475.0
삼성바이오로직스    207940            NaN   91900.0

In [17]:
stockDF.dropna(inplace=True)
stockDF

                id          value     price
stock_name
한미약품        128940   59385.666667  421000.0
CJ E&M      130960   58540.666667   98900.0
엔에스쇼핑       138250   14558.666667   13200.0
이마트         139480  239230.833333  254500.0
녹십자엠에스      142280     468.833333   10200.0
삼양사         145990   82750.000000   82000.0
종근당         185750   40293.666667  100500.0
쿠쿠홀딩스       192400  179204.666667  177500.0
툴젠          199800   -2514.333333  115400.0
모두투어리츠      204210    3093.333333    3475.0